# DATA WAREHOUSES AND ASSOCIATION RULES (Part A)

### Part A: Data Warehouse

- Port Number PostgreSQL: 5433
- Password: kilberryshake

#### Q1 Data Cube

In [164]:
import pandas as pd
from sqlalchemy import create_engine, text

In [165]:
%pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\sean\documents\anaconda install\lib\site-packages (2.9.9)
Note: you may need to restart the kernel to use updated packages.

In [166]:
df = pd.read_csv("DW_dataset.csv")
df.head()

,Employee ID,Name,Date of Birth,Gender,Job Title,Salary,Date Joined,Date Left,Address
0,100,Smith,12-Jan-74,M,Director,50000,01-Aug-01,NaN,"12, Green Avenue, Howth, Co. Dublin"
1,125,Jones,06-Apr-89,F,Technician,40000,01-May-01,31-Aug-02,"43, School Road, Malahide, Co. Dublin"
2,167,Davis,19-Jan-82,F,Senior Technician,50000,01-Dec-02,NaN,"10, Main Street, Naas, Co. Kildare"
3,200,O'Bien,03-May-97,M,Technician,25000,01-May-02,30-Nov-02,"Apt 02, High Court, Condalkin. Co. Dublin"
4,205,Edward,16-Nov-95,M,Technician,33000,01-Jan-01,NaN,"33, Barake Street, Clane, Co. Kildare"

In [167]:
df['Job Title'] = df['Job Title'].str.strip() 
df['Gender'] = df['Gender'].str.strip() 
df[['Address', 'County']] = df["Address"].str.split(r"\bCo\b", expand=True) 
df['County']=df['County'].str.replace(r'.',"", regex=True) 
df['Date of Birth'] =  pd.to_datetime(df['Date of Birth'], infer_datetime_format=True) 
df['Date Joined'] =  pd.to_datetime(df['Date Joined'], infer_datetime_format=True) 
df['Date Left'] =  pd.to_datetime(df['Date Left'], infer_datetime_format=True) 
 
def getJobCategory(x): 
    y = x.split(' '); 
    if 'Technician' in y: 
        return 'Technical' 
    elif 'Director' in y: 
        return 'Management' 
    elif 'Manager' in y: 
        return 'Management' 
 
df['Job Category'] = df["Job Title"].apply(getJobCategory) 
df = df.drop(['Address', 'Job Title'], axis=1)
df.head()

,Employee ID,Name,Date of Birth,Gender,Salary,Date Joined,Date Left,County,Job Category
0,100,Smith,1974-01-12,M,50000,2001-08-01,NaT,Dublin,Management
1,125,Jones,1989-04-06,F,40000,2001-05-01,2002-08-31,Dublin,Technical
2,167,Davis,1982-01-19,F,50000,2002-12-01,NaT,Kildare,Technical
3,200,O'Bien,1997-05-03,M,25000,2002-05-01,2002-11-30,Dublin,Technical
4,205,Edward,1995-11-16,M,33000,2001-01-01,NaT,Kildare,Technical

In [168]:
engine = create_engine('postgresql://postgres:kilberryshake@localhost:5433/db_2a')

In [169]:
df.to_sql('db_2a', engine, if_exists='replace', index=False)

16

(1) The average salary of management staff for males and females separately.

In [170]:
# SQL query to calculate the average salary for male management staff
average_male_management_salary_query = '''
SELECT AVG("Salary") AS average_male_salary
FROM "db_2a"
WHERE "Gender" = 'M' AND "Job Category" = 'Management';
'''

average_female_management_salary_query = '''
SELECT AVG("Salary") AS average_female_salary
FROM "db_2a"
WHERE "Gender" = 'F' AND "Job Category" = 'Management';
'''

with engine.connect() as conn:
    result_male = conn.execute(text(average_male_management_salary_query)).fetchone()
    result_female = conn.execute(text(average_female_management_salary_query)).fetchone()

In [171]:
average_male_salary = result_male[0] if result_male else None
print("The avergae salary of male management staff is", round(average_male_salary, 2))

average_female_salary = result_female[0] if result_male else None
print("The avergae salary of female management staff is", round(average_female_salary, 2))

The avergae salary of male management staff is 65000.00
The avergae salary of female management staff is 74333.33

(2)

In [172]:
average_salary_by_gender_county_query = '''
SELECT "Gender", "County", AVG("Salary") AS average_salary
FROM "db_2a"
GROUP BY "Gender", "County";
'''

# Execute the query and fetch the results
with engine.connect() as conn:
    results = conn.execute(text(average_salary_by_gender_county_query)).fetchall()

# Print the results
for row in results:
    gender, county, average_salary = row
    print(f"Average Salary for {gender} employees in {county}: {average_salary}")

Average Salary for F employees in  Dublin: 54500.000000000000
Average Salary for M employees in  Dublin: 42833.333333333333
Average Salary for M employees in  Kildare: 66000.000000000000
Average Salary for F employees in  Kildare: 57333.333333333333

(3)

In [173]:
count_1970s_query = '''
SELECT COUNT(*) as count_1970s
FROM "db_2a"
WHERE EXTRACT(YEAR FROM "Date of Birth") BETWEEN 1970 AND 1979
AND "Date Left" IS NULL;
'''

count_1980s_query = '''
SELECT COUNT(*) as count_1980s
FROM "db_2a"
WHERE EXTRACT(YEAR FROM "Date of Birth") BETWEEN 1980 AND 1989
AND "Date Left" IS NULL;
'''

count_1990s_query = '''
SELECT COUNT(*) as count_1990s
FROM "db_2a"
WHERE EXTRACT(YEAR FROM "Date of Birth") BETWEEN 1990 AND 1999
AND "Date Left" IS NULL;
'''

# Execute the queries and fetch the results
with engine.connect() as conn:
    result_1970s = conn.execute(text(count_1970s_query)).fetchone()
    result_1980s = conn.execute(text(count_1980s_query)).fetchone()
    result_1990s = conn.execute(text(count_1990s_query)).fetchone()

# Extract the count of employees born in each decade and employed at the end of 2022
count_1970s = result_1970s['count_1970s'] if result_1970s else 0
count_1980s = result_1980s['count_1980s'] if result_1980s else 0
count_1990s = result_1990s['count_1990s'] if result_1990s else 0

# Print the results
print(f"Number of Employees born in the 1970s employed at the end of 2022: {count_1970s}")
print(f"Number of Employees born in the 1980s employed at the end of 2022: {count_1980s}")
print(f"Number of Employees born in the 1990s employed at the end of 2022: {count_1990s}")

Number of Employees born in the 1970s employed at the end of 2022: 4
Number of Employees born in the 1980s employed at the end of 2022: 3
Number of Employees born in the 1990s employed at the end of 2022: 2

(4) What are the employee retention rates in 2001 and 2002?

Retention rate: how many employees were in the company on 1st Jan 2001. Then out of those employees, how many are still in the company on 31st Dec 2001.

In [174]:
retention_rate_2001_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-01-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2001-12-31')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-01-01') * 100 AS retention_rate_2001;
'''

retention_rate_2002_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-01-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2002-12-31')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-01-01') * 100 AS retention_rate_2002;
'''

with engine.connect() as conn:
    result1 = conn.execute(text(retention_rate_2001_query)).fetchone()
    result2 = conn.execute(text(retention_rate_2002_query)).fetchone()

# Extract the retention rate for 2001
retention_rate_2001 = result1['retention_rate_2001']
retention_rate_2002 = result2['retention_rate_2002']

print(f"Retention Rate in 2001: {retention_rate_2001:.2f}%")
print(f"Retention Rate in 2002: {retention_rate_2002:.2f}%")

Retention Rate in 2001: 100.00%
Retention Rate in 2002: 0.00%

(5) Show the retention rates based on the quarter of the years 2001 and 2002.

In [175]:
retention_rate_2001_q1_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-01-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2001-03-31')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-01-01') * 100 AS retention_rate_2001_q1; 
'''

retention_rate_2001_q2_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-04-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2001-06-30')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-04-01') * 100 AS retention_rate_2001_q2;
'''

retention_rate_2001_q3_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-07-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2001-09-30')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-07-01') * 100 AS retention_rate_2001_q3;
'''

retention_rate_2001_q4_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-10-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2001-12-31')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2001-10-01') * 100 AS retention_rate_2001_q4;
'''

with engine.connect() as conn:
    result1 = conn.execute(text(retention_rate_2001_q1_query)).fetchone()
    result2 = conn.execute(text(retention_rate_2001_q2_query)).fetchone()
    result3 = conn.execute(text(retention_rate_2001_q3_query)).fetchone()
    result4 = conn.execute(text(retention_rate_2001_q4_query)).fetchone()

# Extract the retention rate for 2001
retention_rate_2001_q1 = result1['retention_rate_2001_q1']
retention_rate_2001_q2 = result2['retention_rate_2001_q2']
retention_rate_2001_q3 = result3['retention_rate_2001_q3']
retention_rate_2001_q4 = result4['retention_rate_2001_q4']


print(f"Retention Rate in 2001 Q1: {retention_rate_2001_q1:.2f}%")
print(f"Retention Rate in 2001 Q2: {retention_rate_2001_q2:.2f}%")
print(f"Retention Rate in 2001 Q3: {retention_rate_2001_q3:.2f}%")
print(f"Retention Rate in 2001 Q4: {retention_rate_2001_q4:.2f}%")

Retention Rate in 2001 Q1: 100.00%
Retention Rate in 2001 Q2: 100.00%
Retention Rate in 2001 Q3: 100.00%
Retention Rate in 2001 Q4: 100.00%

In [176]:
retention_rate_2002_q1_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-01-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2002-03-31')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-01-01') * 100 AS retention_rate_2002_q1; 
'''

retention_rate_2002_q2_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-04-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2002-06-30')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-04-01') * 100 AS retention_rate_2002_q2;
'''

retention_rate_2002_q3_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-07-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2002-09-30')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-07-01') * 100 AS retention_rate_2002_q3;
'''

retention_rate_2002_q4_query = '''
SELECT
    ((SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-10-01') - 
    (SELECT COUNT(*) FROM db_2a WHERE "Date Left" IS NOT NULL AND "Date Left" < '2002-12-31')) /
    (SELECT COUNT(*) FROM db_2a WHERE "Date Joined" <= '2002-10-01') * 100 AS retention_rate_2002_q4;
'''

with engine.connect() as conn:
    result1 = conn.execute(text(retention_rate_2002_q1_query)).fetchone()
    result2 = conn.execute(text(retention_rate_2002_q2_query)).fetchone()
    result3 = conn.execute(text(retention_rate_2002_q3_query)).fetchone()
    result4 = conn.execute(text(retention_rate_2002_q4_query)).fetchone()

# Extract the retention rate for 2001
retention_rate_2002_q1 = result1['retention_rate_2002_q1']
retention_rate_2002_q2 = result2['retention_rate_2002_q2']
retention_rate_2002_q3 = result3['retention_rate_2002_q3']
retention_rate_2002_q4 = result4['retention_rate_2002_q4']


print(f"Retention Rate in 2002 Q1: {retention_rate_2002_q1:.2f}%")
print(f"Retention Rate in 2002 Q2: {retention_rate_2002_q2:.2f}%")
print(f"Retention Rate in 2002 Q3: {retention_rate_2002_q3:.2f}%")
print(f"Retention Rate in 2002 Q4: {retention_rate_2002_q4:.2f}%")

Retention Rate in 2002 Q1: 100.00%
Retention Rate in 2002 Q2: 0.00%
Retention Rate in 2002 Q3: 0.00%
Retention Rate in 2002 Q4: 0.00%

#### Q2: Data Warehouse - Implementation